ErpTest/src/Documents/пкИзменениеСтатусаТехники/пкИзменениеСтатусаТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкИзменениеСтатусаТехники</name>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <attributes>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкИзменениеСтатусаТехники/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура СтатусПриИзмененииНаСервере()
    
    Если Объект.Статус = Перечисления.пкСтатусыТехники.НаБазе Тогда 
        Объект.ЗаявкаНаАрендуТехники = Неопределено;
        Объект.ОбъектСтроительства   = Неопределено;
        
        Элементы.ЗаявкаНаАрендуТехники.Видимость = Ложь;
        Элементы.ОбъектСтроительства.Видимость   = Ложь;
        
        Элементы.Склад.Видимость                 = Истина;
    Иначе
        Объект.Склад = Неопределено;
        
        Элементы.Склад.Видимость                 = Ложь;
        Элементы.ЗаявкаНаАрендуТехники.Видимость = Истина;
        Элементы.ОбъектСтроительства.Видимость   = Истина;
    КонецЕсли;    
    
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
    
    СтатусПриИзмененииНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Объект.Ответственный = Пользователи.ТекущийПользователь();
    
    СтатусПриИзмененииНаСервере();
    
КонецПроцедуры
